backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, null, null, null, 3]
      dtype: float32
      name: input
      sparse: false
    inbound_nodes: []
    name: input
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple [1, 1, 1]
      dtype: float32
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 5, 5]
      name: e1_conv
      padding: same
      strides: !!python/tuple [1, 2, 2]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - input
        - 0
        - 0
        - {}
    name: e1_conv
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: e1_bn
      scale: true
      trainable: true
    inbound_nodes:
    - - - e1_conv
        - 0
        - 0
        - {}
    name: e1_bn
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: e1_activation, trainable: true}
    inbound_nodes:
    - - - e1_bn
        - 0
        - 0
        - {}
    name: e1_activation
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 3, 3]
      name: e2_conv
      padding: same
      strides: &id002 !!python/tuple [1, 1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - e1_activation
        - 0
        - 0
        - {}
    name: e2_conv
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: e2_bn
      scale: true
      trainable: true
    inbound_nodes:
    - - - e2_conv
        - 0
        - 0
        - {}
    name: e2_bn
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: e2_activation, trainable: true}
    inbound_nodes:
    - - - e2_bn
        - 0
        - 0
        - {}
    name: e2_activation
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 3, 3]
      name: e3_conv
      padding: same
      strides: !!python/tuple [1, 2, 2]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - e2_activation
        - 0
        - 0
        - {}
    name: e3_conv
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: e3_bn
      scale: true
      trainable: true
    inbound_nodes:
    - - - e3_conv
        - 0
        - 0
        - {}
    name: e3_bn
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: e3_activation, trainable: true}
    inbound_nodes:
    - - - e3_bn
        - 0
        - 0
        - {}
    name: e3_activation
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 3, 3]
      name: e4_conv
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - e3_activation
        - 0
        - 0
        - {}
    name: e4_conv
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: e4_bn
      scale: true
      trainable: true
    inbound_nodes:
    - - - e4_conv
        - 0
        - 0
        - {}
    name: e4_bn
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: e4_activation, trainable: true}
    inbound_nodes:
    - - - e4_bn
        - 0
        - 0
        - {}
    name: e4_activation
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 3, 3]
      name: e5_conv
      padding: same
      strides: !!python/tuple [1, 2, 2]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - e4_activation
        - 0
        - 0
        - {}
    name: e5_conv
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: e5_bn
      scale: true
      trainable: true
    inbound_nodes:
    - - - e5_conv
        - 0
        - 0
        - {}
    name: e5_bn
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: e5_activation, trainable: true}
    inbound_nodes:
    - - - e5_bn
        - 0
        - 0
        - {}
    name: e5_activation
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3, 3]
      name: center_conv
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - e5_activation
        - 0
        - 0
        - {}
    name: center_conv
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: center_bn
      scale: true
      trainable: true
    inbound_nodes:
    - - - center_conv
        - 0
        - 0
        - {}
    name: center_bn
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: center_activation, trainable: true}
    inbound_nodes:
    - - - center_bn
        - 0
        - 0
        - {}
    name: center_activation
  - class_name: Conv3DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dtype: float32
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 3, 3]
      name: d4_convT
      output_padding: null
      padding: same
      strides: !!python/tuple [1, 2, 2]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - center_activation
        - 0
        - 0
        - {}
    name: d4_convT
  - class_name: Conv3DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dtype: float32
      filters: 4
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1, 1]
      name: d4_into_bottleneck
      output_padding: null
      padding: same
      strides: &id004 !!python/tuple [1, 1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - e4_activation
        - 0
        - 0
        - {}
    name: d4_into_bottleneck
  - class_name: Concatenate
    config: {axis: -1, dtype: float32, name: d4_concat, trainable: true}
    inbound_nodes:
    - - - d4_convT
        - 0
        - 0
        - &id003 {}
      - - d4_into_bottleneck
        - 0
        - 0
        - *id003
    name: d4_concat
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: d4_bn
      scale: true
      trainable: true
    inbound_nodes:
    - - - d4_concat
        - 0
        - 0
        - {}
    name: d4_bn
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: d4_activation, trainable: true}
    inbound_nodes:
    - - - d4_bn
        - 0
        - 0
        - {}
    name: d4_activation
  - class_name: Conv3DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dtype: float32
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 3, 3]
      name: d3_convT
      output_padding: null
      padding: same
      strides: *id004
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - d4_activation
        - 0
        - 0
        - {}
    name: d3_convT
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: d3_bn
      scale: true
      trainable: true
    inbound_nodes:
    - - - d3_convT
        - 0
        - 0
        - {}
    name: d3_bn
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: d3_activation, trainable: true}
    inbound_nodes:
    - - - d3_bn
        - 0
        - 0
        - {}
    name: d3_activation
  - class_name: Conv3DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dtype: float32
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 3, 3]
      name: d2_convT
      output_padding: null
      padding: same
      strides: !!python/tuple [1, 2, 2]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - d3_activation
        - 0
        - 0
        - {}
    name: d2_convT
  - class_name: Conv3DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dtype: float32
      filters: 2
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1, 1]
      name: d2_into_bottleneck
      output_padding: null
      padding: same
      strides: *id004
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - e2_activation
        - 0
        - 0
        - {}
    name: d2_into_bottleneck
  - class_name: Concatenate
    config: {axis: -1, dtype: float32, name: d2_concat, trainable: true}
    inbound_nodes:
    - - - d2_convT
        - 0
        - 0
        - &id005 {}
      - - d2_into_bottleneck
        - 0
        - 0
        - *id005
    name: d2_concat
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: d2_bn
      scale: true
      trainable: true
    inbound_nodes:
    - - - d2_concat
        - 0
        - 0
        - {}
    name: d2_bn
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: d2_activation, trainable: true}
    inbound_nodes:
    - - - d2_bn
        - 0
        - 0
        - {}
    name: d2_activation
  - class_name: Conv3DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dtype: float32
      filters: 8
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 3, 3]
      name: d1_convT
      output_padding: null
      padding: same
      strides: !!python/tuple [1, 2, 2]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - d2_activation
        - 0
        - 0
        - {}
    name: d1_convT
  - class_name: Concatenate
    config: {axis: -1, dtype: float32, name: d1_concat, trainable: true}
    inbound_nodes:
    - - - d1_convT
        - 0
        - 0
        - &id006 {}
      - - input
        - 0
        - 0
        - *id006
    name: d1_concat
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: d1_bn
      scale: true
      trainable: true
    inbound_nodes:
    - - - d1_concat
        - 0
        - 0
        - {}
    name: d1_bn
  - class_name: Activation
    config: {activation: relu, dtype: float32, name: d1_activation, trainable: true}
    inbound_nodes:
    - - - d1_bn
        - 0
        - 0
        - {}
    name: d1_activation
  - class_name: Conv3D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: normal, mode: fan_in, scale: 2.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 5, 5]
      name: p_conv
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - d1_activation
        - 0
        - 0
        - {}
    name: p_conv
  - class_name: Activation
    config: {activation: sigmoid, dtype: float32, name: p_hat, trainable: true}
    inbound_nodes:
    - - - p_conv
        - 0
        - 0
        - {}
    name: p_hat
  name: model_4
  output_layers:
  - [p_hat, 0, 0]
keras_version: 2.3.1
